# Day 13 - Pandas Part-2

### Filtering Data from String In different ways

In [8]:
import pandas as pd
data = {
    "Name" : ["Nabil", "Nafis", "Towa", "Riyan", "Rayhan", "Hiya"],
    "Age" : [23, 16, 6, 9, 15, 24],
    "City" : ["York New", "Los Angeles", "New Jersey", "Chicago", "The new Delhi", "Boston"],
    "Salary" : [50000, 82000, 65000, 47000, 58000, 49000 ]
}

df = pd.DataFrame(data)
df

     Name  Age           City  Salary
0   Nabil   23       York New   50000
1   Nafis   16    Los Angeles   82000
2    Towa    6     New Jersey   65000
3   Riyan    9        Chicago   47000
4  Rayhan   15  The new Delhi   58000
5    Hiya   24         Boston   49000

In [9]:
# Finding "New" anywhere from a column or city ,,, case sensitive

df.loc[df['City'].str.contains("New")]

    Name  Age        City  Salary
0  Nabil   23    York New   50000
2   Towa    6  New Jersey   65000

In [10]:
# character case doesn't matter

df.loc[df['City'].str.contains("new", case= False)]

     Name  Age           City  Salary
0   Nabil   23       York New   50000
2    Towa    6     New Jersey   65000
4  Rayhan   15  The new Delhi   58000

### Regular expression
Regular expression is used for efficient text processing.

In [12]:
# city starts with "New" only

df.loc[df['City'].str.contains(r"^New")]

   Name  Age        City  Salary
2  Towa    6  New Jersey   65000

In [15]:
# name ends with "an" only

df.loc[df['Name'].str.contains(r"an$")]

     Name  Age           City  Salary
3   Riyan    9        Chicago   47000
4  Rayhan   15  The new Delhi   58000

In [16]:
# name ends with a vowel only

df.loc[df['Name'].str.contains(r"[aeiou]$")]

   Name  Age        City  Salary
2  Towa    6  New Jersey   65000
5  Hiya   24      Boston   49000

In [19]:
# Multiple filtering (contains new or los)

df.loc[df['City'].str.contains(r"New|Los", case=False)]

     Name  Age           City  Salary
0   Nabil   23       York New   50000
1   Nafis   16    Los Angeles   82000
2    Towa    6     New Jersey   65000
4  Rayhan   15  The new Delhi   58000

### Adding new columns / features

In [24]:
df = pd.read_csv('D14-1_student_completed_data.csv')
df.head()

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location
0,PH0001,Alif Rahman,59.0,59.0,88.0,Completed,9/1/2024,Ms. Salma,Khulna
1,PH0002,Fatima Akhter,98.0,98.0,NaN,Completed,8/11/2024,Mr. Karim,Dhaka
2,PH0003,Imran Hossain,85.0,85.0,69.0,Completed,5/8/2024,Ms. Salma,Dhaka
3,PH0004,Jannatul Ferdous,75.0,75.0,65.0,Completed,7/5/2024,Mr. Karim,Khulna
4,PH0005,Kamal Uddin,69.0,69.0,89.0,Completed,2/1/2024,Mr. David,Sylhet

In [35]:
# Adding a column with constant value
df['Country'] = 'Bangladesh'
df.head()

# Adding column with another columns
df['Total marks'] = df['DS marks'] + df['Algo marks'] + df['Python marks']
df.head()

# create column with condition
df['Passed in Algo'] = df['Algo marks'] > 70
df.head()

# new column by adding valus of another column using numpy
import numpy as np
df['A+ in DS'] = np.where(df['DS marks'] > 90, 'A+', 'A')
df.tail()

,StudentID,FullName,DS marks,Algo marks,Python marks,CompletionStatus,EnrollmentDate,Instructor,Location,Country,Total marks,A+ in DS,Passed in Algo
15,PH0016,Ziaur Rahman,89.0,89.0,79.0,Completed,3/23/2024,Ms. Salma,Rajshahi,Bangladesh,257.0,A,True
16,PH0017,Afsana Mimi,86.0,86.0,84.0,Completed,1/18/2024,Mr. David,Khulna,Bangladesh,256.0,A,True
17,PH0018,Babul Ahmed,98.0,98.0,63.0,Completed,6/23/2024,Mr. David,Dhaka,Bangladesh,259.0,A+,True
18,PH0019,Faria Rahman,92.0,92.0,90.0,Completed,4/19/2024,Mr. Karim,Sylhet,Bangladesh,274.0,A+,True
19,PH0020,Tariq Hasan,80.0,80.0,87.0,Completed,7/21/2024,Mr. Karim,Khulna,Bangladesh,247.0,A,True